cask_args appdir: "/Applications"

tap "anomalyco/tap"
tap "homebrew/core"
tap "microsoft/git"
tap "zero-sh/tap"

brew "zero-sh/tap/zero"
brew "mas"

# Command line
brew "starship"
brew "bash"
brew "ffmpeg"
brew "imagemagick"
brew "pngcrush"
brew "shellcheck"
brew "stow"
brew "thefuck"
brew "wget"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "fonttools"

# GNU
brew "coreutils"
brew "findutils"
brew "gawk"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"

# Programming environments
brew "mise"
brew "platformio"
brew "ninja"
brew "dfu-util"
brew "mint"

# Fonts
cask "font-meslo-lg-nerd-font"
cask "font-powerline-symbols"

# Editors & IDEs
cask "jetbrains-toolbox"
cask "zed"
brew "vim"
cask "visual-studio-code"
mas "xcode", id: 497799835
cask "antigravity"

# Development tools
cask "docker"
cask "fork"
brew "git"
brew "git-lfs"
cask "google-cloud-sdk"
cask "gpg-suite-no-mail"
cask "vysor"
cask "rapidapi"
brew "apktool"
brew "awscli"
cask "docker-desktop"

# Tools to make MacOS nicer
cask "aerial"
cask "bettertouchtool"
cask "alt-tab"
cask "karabiner-elements"
cask "notunes"
cask "stay"
brew "duti"
cask "maccy"

# Tools
brew "yt-dlp"

# AI
brew "anomalyco/tap/opencode"
cask "claude-code"
cask "codex"
cask "claude"
cask "cursor"
cask "codex-app"

# Desktop apps
mas "bitwarden", id: 1352778147
cask "finicky"
cask "brave-browser"
cask "google-drive"
cask "kap"
cask "kitty"
cask "slack"
cask "vlc"
cask "zoom"
cask "obsidian"

# Design
cask "figma"
cask "gimp"
cask "sketch"
cask "affinity"
cask "affinity-designer"

# Non-essential hobby apps
cask "arduino"
cask "audio-hijack"
cask "loopback"
cask "openscad"
cask "discord"
cask "bambu-studio"
cask "godot"
cask "musicbrainz-picard"
cask "yubico-authenticator"

# Gaming
cask "steam"
