cask_args appdir: "/Applications"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "microsoft/git"

# Command line
brew "bash"
brew "ffmpeg"
brew "imagemagick"
brew "thefuck"
brew "wget"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# GNU
brew "findutils"
brew "gnu-sed"
brew "grep"

# Programming environments
cask "adoptopenjdk"
cask "adoptopenjdk8"
#brew "node"
brew "nodenv"
#brew "python@3.9"
brew "pyenv"
#brew "ruby"
brew "rbenv"
brew "jenv"

# Editors & IDEs
cask "jetbrains-toolbox"
cask "sublime-text"
brew "vim"
cask "visual-studio-code"
mas "xcode", id: 497799835

# Development tools
cask "fork"
brew "git"
cask "gpg-suite-no-mail"

# Tools to make MacOS nicer
cask "aerial"
cask "bettertouchtool"
cask "hyperswitch"
cask "karabiner-elements"
cask "stay"

# Tools
brew "apktool"
cask "docker"
brew "youtube-dl"

# Desktop apps
mas "bitwarden", id: 1352778147
cask "brave-browser"
cask "google-drive-file-stream"
cask "kitty"
cask "slack"
cask "vlc"
cask "zoomus"

# Design
cask "figma"
cask "gimp"
cask "sketch"

# Non-essential hobby apps
cask "arduino"
cask "audio-hijack"
cask "loopback"
cask "openscad"

# Gaming
cask "steam"
