cask_args appdir: "/Applications"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "microsoft/git"

brew "mas"

# Command line
brew "starship"
brew "bash"
brew "ffmpeg"
brew "imagemagick"
brew "pngcrush"
brew "shellcheck"
brew "stow"
brew "thefuck"
brew "wget"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# GNU
brew "coreutils"
brew "findutils"
brew "gawk"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"

# Programming environments
cask "temurin"
cask "temurin8"
cask "temurin11"
brew "node"
brew "ruby"
brew "python"
brew "go"
brew "mise"
cask "flutter"
brew "platformio"
brew "cmake"
brew "ninja"
brew "dfu-util"
brew "mint"

# Fonts
cask "font-meslo-lg-nerd-font"
cask "font-powerline-symbols"

# Editors & IDEs
cask "jetbrains-toolbox"
cask "sublime-text"
brew "vim"
cask "visual-studio-code"
mas "xcode", id: 497799835

# Development tools
cask "docker"
cask "fork"
brew "git"
brew "git-lfs"
cask "google-cloud-sdk"
cask "gpg-suite-no-mail"
cask "vysor"
cask "rapidapi"
brew "apktool"

# Tools to make MacOS nicer
cask "aerial"
cask "bettertouchtool"
cask "alt-tab"
cask "karabiner-elements"
cask "notunes"
cask "stay"
brew "duti"
brew "maccy"

# Tools
brew "youtube-dl"

# Desktop apps
mas "bitwarden", id: 1352778147
cask "finicky"
cask "brave-browser"
cask "discord"
cask "google-drive"
cask "kap"
cask "kitty"
cask "slack"
cask "vlc"
cask "zoom"

# Design
cask "figma"
cask "gimp"
cask "sketch"

# Non-essential hobby apps
cask "arduino"
cask "audio-hijack"
cask "loopback"
cask "openscad"
cask "discord"

# Gaming
cask "steam"
